/******************** (C) COPYRIGHT  风驰iCreate嵌入式开发工作室 **************
 * 文件名  ：tim.c
 * 描述    ：STM8--TIM1模块配置函数
 * 实验平台：风驰STM8开发板
 * 库版本  ：V2.1.0
 * 作者    ：风驰  QQ：779814207
 * 博客    ：
 * 淘宝    ：http://shop71177993.taobao.com/
 * 修改时间 ：2012-10-30

  风驰STM8开发板硬件连接
    |--------------------|
    |  LED1-PD0          |
    |  LED2-PD1          |
    |  LED3-PD2          |
    |  LED4-PD3          |
    |--------------------|

*******************************************************************************/

/* 包含系统头文件 */

/* 包含自定义头文件 */
#include "tim1.h"

/* 自定义新类型 */

/* 自定义宏 */

/* 全局变量定义 */
unsigned int TimingDelay;

/*******************************************************************************
 * 名称: Tim1_Init
 * 功能: TIM1初始化操作
 * 形参: 无
 * 返回: 无
 * 说明: cpu 内部clk = 8M
 ******************************************************************************/
void Tim1_Init(void)
{
    /* 初始化TIM1为外部时钟2分频 向上计数模式 计数周期3333.2 计数初始值0 -- 833us(24点采样)进一次中断*/
    TIM1_TimeBaseInit(1, TIM1_COUNTERMODE_UP, 3332, 0);
    TIM1_SetCounter(0);/* 将计数器初值设为0 */
    TIM1_ARRPreloadConfig(DISABLE); /* 预装载不使能 */
    TIM1_ITConfig(TIM1_IT_UPDATE , ENABLE); /* 计数器向上计数/向下计数溢出更新中断 */
    TIM1_Cmd(ENABLE);           /* 使能TIM1 */

}


/*******************************************************************************
 * 名称: Delay
 * 功能: 简单的延时函数
 * 形参: nCount -> 延时时间数
 * 返回: 无
 * 说明: 无8M时
                1 1000 = 3.8ms
                2 2000 = 10.4ms
                3 3000 = 14.2ms
                4 5000 = 24.4ms
 ******************************************************************************/
/*
static void DelayTim1(u32 nCount)
{
    / * Decrement nCount value * /
    while (nCount != 0)
    {
        nCount--;
    }
}
*/


/*******************************************************************************
 * 名称: Tim1_Stop
 * 功能: TIM1关闭计数器
 * 形参: 无
 * 返回: 无
 * 说明: 无
 ******************************************************************************/
void Tim1_Stop(void)
{
    TIM1_Cmd(DISABLE);
    TIM1_SetCounter(1);
    TIM1_ITConfig(TIM1_IT_UPDATE , DISABLE);
}

/*******************************************************************************
 * 名称: Tim1_Start
 * 功能: TIM1打开计数器
 * 形参: 无
 * 返回: 无
 * 说明: 无
 ******************************************************************************/
void Tim1_Start(void)
{
    TIM1_ClearITPendingBit(TIM1_IT_UPDATE);
    TIM1_Cmd(ENABLE);
    TIM1_ITConfig(TIM1_IT_UPDATE , ENABLE);
}




/*******************************************************************************
 * 名称: delay_ms
 * 功能: 利用TIM1产生的10ms中断来计时
 * 形参: nms -> 计时值(ms)
 * 返回: 无
 * 说明: 无
           1 自带喂狗;决不能放入主程序
           2 100 表示 1s
 ******************************************************************************/
void delay_ms( unsigned int nTime)
{
    TimingDelay = nTime;

//    while(0 != TimingDelay)
//        IWDG_ReloadCounter();
}
/*************** (C) COPYRIGHT 杭州中深电力技术有限公司 *****END OF FILE****/

